void main() {
  //ฟังก์ชั่นสำหรับเรียกใช้งาน
  // int Num=1,NuM=2,num=3,NUM=4;
  int Num = 1, NuM = 2, num = 3, NUM$ = 4;
  /*case sensitive ตัวเล็กตัวใหญ่คือคนละ variable
  คำสั่งในการเขียนโปรแกรมห้ามนำมาสร้างเป็น variable เช่น int void แต่สามารถใส่ อักษรพิเศษบางอย่างได้ เช่น _void $int
  ห้ามใส่ตัวเลขหน้าชื่อของ variable
  ไม่สามารถใส่อักขระพิเศษได้ ยกเว้น $ ถ้าเรียกใช้หลายตัวแปรที่ต้องใ*/
  // print('$Num $NuM $num $NUM');
  ////เรียกใช้หลายตัวแประต้องใช้ $
  // print('$Num $NuM $num ${NUM$}');
  print('$Num $NuM $num+2+6 ${NUM$ + 1 + 3}');
  //ถ้าจะคำนวนค่าตัวแปรให้ใส่ {} ถ้าไม่ใส่จะเป็นการเชื่อมสตริง
}
